insd47/Drunksafe/firmware/sdkconfig.defaults
# ESP32 DevKitC V4 uses the classic ESP32 chip.
CONFIG_IDF_TARGET="esp32"

# Rust often needs more main task stack than the ESP-IDF C default.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=4096
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=4096

# Keep the serial output useful while the project is still boilerplate.
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
